### Importing the packages

In [1]:
import pandas as pd
import numpy as np

### Data

In [8]:
data=pd.read_csv('Index2018.csv')
df=data.copy()

In [10]:
df.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

### Lenght of the time period

In [9]:
df.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

### Text to date

In [11]:
df.date=pd.to_datetime(df.date,dayfirst=True)#assumes we re plugging data in m/d/y format
#our data is d/m/y format

In [12]:
df.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the index:

In [13]:
df.set_index("date",inplace=True)

In [14]:
df.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the desired frequency:

In [15]:
df=df.asfreq('d')# d for daily

In [17]:
df.head(10)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-15     NaN      NaN      NaN       NaN
1994-01-16     NaN      NaN      NaN       NaN

In [18]:
df=df.asfreq('b')# b for business days

In [20]:
df.head(10)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26
1994-01-14  474.91  2151.05  3400.56  18973.70
1994-01-17  473.30  2115.56  3407.83  18725.37
1994-01-18  474.25  2130.35  3437.01  18514.55
1994-01-19  474.30  2132.52  3475.15  19039.40
1994-01-20  474.98  2098.36  3469.99  19183.92

### Handling missing values

In [21]:
df.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [22]:
df.spx=df.spx.fillna(method="ffill")#front filling

In [ ]:
df.ftse=df.ftse.fillna(method="bfill")#back filling

In [23]:
df.dax=df.dax.fillna(value=df.dax.mean())#imputing with the mean value

In [24]:
df.nikkei=df.nikkei.fillna(method="bfill")#back filling

In [25]:
df.isna().sum()

spx       0
dax       0
ftse      8
nikkei    0
dtype: int64

### Simplifying the dataset

In [26]:
df['market_value']=df.spx

In [27]:
df.head()

               spx      dax     ftse    nikkei  market_value
date
1994-01-07  469.90  2224.95  3445.98  18124.01        469.90
1994-01-10  475.27  2225.00  3440.58  18443.44        475.27
1994-01-11  474.13  2228.10  3413.77  18485.25        474.13
1994-01-12  474.17  2182.06  3372.02  18793.88        474.17
1994-01-13  472.47  2142.37  3360.01  18577.26        472.47

In [30]:
del df['dax'],df['ftse'],df['nikkei']

In [31]:
df.head()

            market_value
date
1994-01-07        469.90
1994-01-10        475.27
1994-01-11        474.13
1994-01-12        474.17
1994-01-13        472.47

### Train test split

In [32]:
size=int(len(df)*0.8)

In [33]:
train=df.iloc[:size]
test=df.iloc[size:]